import os #系统模块
import time 
os.system('cls') #清屏指令
print("*" * 60)
time.sleep(1)
print("*" * 25 + "人生模拟器" +"*" * 25)
time.sleep(1)
print("*" * 60)
shijian = input("请输入你最喜欢的季节（春/夏/秋/冬）：")
#    选择出生季节
if shijian == "春":
    print("在一个春暖花开的日子里，你出生了")
elif shijian == "夏" :
    print("在一个夏日炎炎的日子里，你出生了")
elif shijian == "秋":
    print("在一个硕果飘香的日子里，你出生了")
else:
    print("在一个白雪皑皑的日子里，你出生了")
time.sleep(2)
    # 主人公命名
name=input("请给自己取个名吧：")
print(f"你好呀，{name}，时间一天天过去,你也一天天长大，  今天是你的抓周宴")
time.sleep(2)
print("在你周围有 1.书和🖊， 2.剑（玩具）🗡，  3.糖葫芦一串   ")
#抓周选择ing 
zhou=int(input("你选择了(填数字)："))
time.sleep(1)
#第一次选择------------抓周
if zhou == 1 :
    print("家里觉得你绝对是考青花被达的料子，给你买了许多幼儿启蒙书和辅导书😀")
    print("于是从那以后你每天都遨游在书海")
    time.sleep(2)
    print("长时间看书让你在五岁时得了近视，你戴上了眼镜👀")
    time.sleep(2)
    print("很快，你上小学三年级了，因为从小就开始看书，你比其他人更加聪明，更加易学")
    time.sleep(2)
    print("好的一切在上初中时被打破了")
    time.sleep(2)
    print("有个叫曹茹的人因嫉妒你的才华，开始在班级里对你处处针对！！")
    time.sleep(3)
    #-------被霸凌----你会怎么做？------------
    youraction = ["你想了想","1.退亿步海阔天空/(ㄒoㄒ)/~~","2.告诉老师或家长，请求帮助🙁"]
    for i in youraction :
        print(i)
    act=int(input("你的选择是 （输入数字） ："))
    if act == 1 :
        print("你一退再退，曹茹非常得意，一度把你认为软柿子")
        time.sleep(2)
        print("你在霸凌下越来越沉默")
        time.sleep(2)
        print("在你临近初中毕业，你得了抑郁症")
        time.sleep(2)
        print("在毕业当天，最后一次的霸凌你没挺过来，你从楼上一跃而下")
        time.sleep(3)
        print("像一朵花终于开了，你解脱了？")
    elif act == 2 :
        print("老师在搜集证据后，把曹茹她们教训了一番，她们保证不会再犯？")
        time.sleep(2)
        print("但是妈妈知道后不顾学校劝说报了警，并办理了转学手续")
        time.sleep(2)
        print("你的生活再次安静了，很轻松")
        time.sleep(2)
        print("马上，你到了高中迎接高考，你发现你好像喜欢上了一个人(❤ ω ❤)")
        #-------------------恋爱💑选择-----------------------------------------
        ai=["你躺在床上翻来覆去睡不着","你在想那个人","你想","要不要现在去表白？"]
        for e in ai :
            time.sleep(2)
            print(e)
        aiact = int(input("你决定（1.要/2.不要）（输入数字）："))
        if aiact == 1 :
            liwu = ["那带什么去呢？","1.一束花❀？","2.直接给一封手写信"] 
       #恋爱关键选择-----------------------------------------------
            for q in liwu :
                time.sleep(2)
                print(q)
            nideai = int(input("你选择（填数字）："))
            if nideai == 1:
                time.sleep(2)
                print("第二天，你带着花❀去表白了")
                time.sleep(2)
                print("你成功了，你很开心o(*￣▽￣*)ブ")
                time.sleep(2)
                print("你们稳稳的幸福，考入各自的大学")
                time.sleep(2)
                print("在你22岁时你们结婚了")
                time.sleep(2)
                print("你们在结婚3年后有了一个宝宝￣︶￣*")
                time.sleep(3)
                print("往后你们都很甜蜜，欢声笑语，一直到永远永远……♥♥♥")
                time.sleep(2)
                print("Happy ending♥")
            elif nideai == 2 :
                time.sleep(2)
                print("你给完信后，你看着那个人打开   （内心期待ing）")
                time.sleep(2)
                print("信上写着：  同学，我喜欢你，我年级第一，你前250都木有，有点蠢哈哈，但是我可以教你，我并不在意😀")
                time.sleep(5)
                print("你表白失败了并得到了对方一记白眼🙄")
                qing_list1=["虽然不知道原因，但是你也只好放入心中","回到学习中，从此也不再想这个了",
                       "随后高考你考入理想大学","在一次工作出差中你又遇到了那个人","你感觉这是缘分","你上前主动打招呼","你们成为了好朋友",
                       "2年后对方向你表白了",
                       "你们在一起了","你们在结婚3年后有了一个宝宝￣︶￣*","往后你们都很甜蜜，欢声笑语，一直到永远永远……♥♥♥"]
                for qing1 in qing_list1 :
                    time.sleep(3)
                    print(qing1)
                print("Happy ending♥")
            elif aiact == 2 :
                qing_list2=["","回到学习中，从此也不再想这个了","随后高考你考入理想大学","在一次工作出差中你又遇到了那个人","你感觉这是缘分",
                            "你上前主动打招呼","你们成为了好朋友","2年后对方向你表白了",
                            "你们在一起了","你们在结婚3年后有了一个宝宝￣︶￣*","往后你们都很甜蜜，欢声笑语，一直到永远永远……♥♥♥"]
                for qing2 in qing_list2 :
                    time.sleep(2)
                    print(qing2)
                print("Happy ending ♥")
elif zhou == 2 :
    #-----------------------------------武术人生-----------------------------
    print("武术奇才吗？家里买了些武术秘籍，在你小的时候就开始念给你听。")
    time.sleep(2)
    print("并在你3岁时去给你认了给师傅")
    time.sleep(2)
    print("修炼要诀：吐纳如丝，意守丹田，心如止水，气贯长虹…………")
    qing_list3=["就这样你勤勤恳恳学到了6岁","太累太累😥你想……要不要放弃呢？","正巧，你的伙伴沈遥来找你去玩泥巴",
                "你内心小人交战","1.玩！玩的就是泥巴","2.不去，还是修炼重要"]
    for qing3 in qing_list3 :
        time.sleep(2)
        print(qing3)
    wu = int(input("你决定（填数字）："))#-----------------------------武术选择----------/------------///---------
    if wu == 1 :
        qing_list4=["你以为这只是一个泥巴旅","随橙想，你不慎掉入了臭水沟","凭借着一身武力",
                   "才侥幸存活😀","狼狈回到家师傅没说什么","只是罚你扎马步7200秒"]
        for qing4 in qing_list4:
            time.sleep(2)
            print(qing4)
        time.sleep(3)
        print("那次后，你在也没偷过懒，勤勤恳恳，一晃15年过去了")
        time.sleep(2)
        qing_list6=["学有所成的你是时候自己去闯闯了","你简单的收拾了一下","与师傅家人告了别","一时间","你竟不知从何开始","去哪里？"
                    ,"你看看天看看地","随便走走吧先🤔","你坚定地迈开步伐","你更想去哪？","1.朝大海走","2.往深山走"]
        for qing6 in qing_list6 :
            time.sleep(3)
            print(qing6)
        #------开启冒险吧!!!!!----------------------------------
        gogogo = int(input("你选择了（填数字）："))
        if gogogo == 1 :
            qing_list7=["你走呀走","空气更加潮湿了","脚下的土地越来越软了","你听到了海浪拍打的声音🌊🌊🌊",
                        "你看到了一望无际的大海","这场旅行你走了5年","不仅仅是看到了海","也欣赏了一路上的风景","结交了许多伙伴",
                        "你很快乐你继续走，走向大海","一身武功的你在海里也很厉害","你很快适应了大海","逐渐长出了腮和噗🐟",
                        "6年后你，长出了尾巴","变成了一条鱼","只有练武的人再加上一直待在海里才能变成🐟",
                        "不久，一身武力的你变成鱼也很厉害(๑•̀ㅂ•́)و✧","你成了海中霸主","海中之霸！！！"]
            for qing7 in qing_list7 :
                time.sleep(3)
                print(qing7)
            print("Happy ending🌊🌊🌊🐳🪼🐋🐠🪸🦀🐚")
        else :
            qing_list8=["你走呀走","树木更多了","植物越来越丰富","你听到了鸟，猴子等的声音🐵🦒🦝🐨🫎",
                        "你看到了成片成片郁郁葱葱的森林","这场旅行你走了5年","不仅仅看到深山","也欣赏了一路上的风景","结交了许多伙伴",
                        "你很快乐你继续走，走向更深的山","一身武功的你在山里也很厉害","你很快适应了深山",
                        "逐渐开始四肢并用地奔跑","6年后，你长出来了獠牙和毛毛","变成了深山兽","只有练武的人再加上一直待在山里才能变成",
                        "一身武力的你变成深山兽也很厉害(๑•̀ㅂ•́)و✧","你成了山中霸主","山中大王！！！"]
            for qing8 in qing_list8:
                time.sleep(3)
                print(qing8)
            print("Happy ending🦁🐯🐗🐸🐼🦄🦍🐈🐲")
    else:
        qing_list5=["沈遥只好自己去玩泥巴","过了一会儿，你听见了“┗|｀O′|┛嗷~~ 嗷~~” ","声音太过凄惨","你循着声音靠近",
                    "发现蠢蛋沈遥竟掉入了臭水沟","你凭借一身武力将其救下","师傅知道后奖励了你一把陨铁刃😀"]
        for qing5 in qing_list5 :
            time.sleep(2)
            print(qing5)
        qing_list6=["学有所成的你是时候自己去闯闯了","你简单的收拾了一下","与师傅家人告了别","一时间","你竟不知从何开始","去哪里？"
                    ,"你看看天看看地","随便走走吧先🤔","你坚定地迈开步伐","你更想去哪？","1.朝大海走","2.往深山走"]
        for qing6 in qing_list6 :
            time.sleep(3)
            print(qing6)
        #------开启冒险吧!!!!!----------------------------------
        gogogo = int(input("你选择了（填数字）："))
        if gogogo == 1 :
            qing_list7=["你走呀走","空气更加潮湿了","脚下的土地越来越软了","你听到了海浪拍打的声音🌊🌊🌊",
                        "你看到了一望无际的大海","这场旅行你走了5年","不仅仅是看到了海","也欣赏了一路上的风景","结交了许多伙伴",
                        "你很快乐你继续走，走向大海","一身武功的你在海里也很厉害","你很快适应了大海","逐渐长出了腮和噗🐟",
                        "6年后你，长出了尾巴","变成了一条鱼","只有练武的人再加上一直待在海里才能变成🐟",
                        "不久，一身武力的你变成鱼也很厉害(๑•̀ㅂ•́)و✧","你成了海中霸主","海中之霸！！！"]
            for qing7 in qing_list7 :
                time.sleep(3)
                print(qing7)
            print("Happy ending🌊🌊🌊🐳🪼🐋🐠🪸🦀🐚")
        else :
            qing_list8=["你走呀走","树木更多了","植物越来越丰富","你听到了鸟，猴子等的声音🐵🦒🦝🐨🫎",
                        "你看到了成片成片郁郁葱葱的森林","这场旅行你走了5年","不仅仅看到深山","也欣赏了一路上的风景","结交了许多伙伴",
                        "你很快乐你继续走，走向更深的山","一身武功的你在山里也很厉害","你很快适应了深山",
                        "逐渐开始四肢并用地奔跑","6年后，你长出来了獠牙和毛毛","变成了深山兽","只有练武的人再加上一直待在山里才能变成",
                        "一身武力的你变成深山兽也很厉害(๑•̀ㅂ•́)و✧","你成了山中霸主","山中大王！！！"]
            for qing8 in qing_list8:
                time.sleep(3)
                print(qing8)
            print("Happy ending🦁🐯🐗🐸🐼🦄🦍🐈🐲")

elif zhou == 3 :
    print("你个小吃货，拿起后就往嘴里塞，大家都笑你会不会变成一只小猪^(*￣(oo)￣)^  哈哈哈哈哈哈")
    qing_list9=["确实，你就是一个小吃货","你非常喜欢吃♥","7年，你吃了🥚🍳🥪🥙🧀🥐","再长大些，你吃了🍕🍔🍟🌭🍿🥨🥙🥗🥫🍱",
                "20岁了，你已经达到惊人的200斤！哈哈","你想要不要减肥嘞？(・∀・(・∀・(・∀・*)","1.减肥，逆袭哇哈哈哈","2.算了，我就是爱吃吃吃"]
    for qing9 in qing_list9 :
        time.sleep(2)
        print(qing9)
    #--------------------------Fat--------------------------
    pang=int(input("你滴选择是："))
    if pang == 1 :
        qing_list10=["减肥之旅并不简单","你第一个星期，共做了50个深蹲","100个开合跳","跑了共计30Km",
                 "你共减18斤","因为你在期间并没有控制饮食","你吃了🍭🎂🍯🍫🍨🍛🍤🍣🥗🥙🍕🧇🥞🍿🌭🍟🧀","没办法，减肥太累了😟","不久",
                 "你便放弃了","你想，如果人固有一死","那我也要是撑死","你继续吃吃吃","25年后",
                 "你的重量打破了银河系记录","达到了惊宇宙的999999999999999999999999吨"]
        for qing10 in qing_list10 :
            time.sleep(2)
            print(qing10)
        print("Fat ending🍟🌭🍿🥞🍤🍣🥗🥙")
    else:
        qing_list11=["你并不想折磨自己","你继续吃","吃吃吃吃吃","🍭🎂🍯🍫🍨🍛🍤🍣🥗🥙🍕🧇🥞🍿🌭🍟🧀",
                     "美味，你尝遍天下美食","你想，如果人固有一死","那我也要是撑死","你继续吃吃吃","25年后","你的重量打破了银河系记录",
                     "达到了惊宇宙的999999999999999999999999吨","你还在大快朵颐","成为了宇宙霸主","整个宇宙都害怕你","10年后","你因吃太多",
                     "你！Bang！！！！你炸了","炸的到处都是","你灭了宇宙","你也没了"]
        for qing11 in qing_list11 :
            time.sleep(2)
            print(qing11)
        print("Fat 然后 die ending🤣😂🤣😂")
else:       
    print("请抓抓抓抓抓抓抓，不能抓别的（霸道）")
